tutorials/06_buildingAero/system/controlDict
FoamFile
{
    version     2.0;
    format     ascii;
    class     dictionary;
    object     controlDict;
}

startFrom startTime;
startTime 0;
stopAt endTime;
endTime 100;
deltaT 1;
writeControl timeStep;
writeInterval 50;
purgeWrite 0;
writeFormat ascii;
writePrecision 6;
writeCompression off;
timeFormat general;
timePrecision 6;
runTimeModifiable true;
solver incompressibleFluid;
