tutorials/06_buildingAero/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       211751;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       211951;
    }
    ground
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2851;
        startFace       212151;
    }
    ceiling
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          800;
        startFace       215002;
    }
    leftWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       215802;
    }
    rightWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       216202;
    }
    buildings
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          11438;
        startFace       216602;
    }
)

// ************************************************************************* //
