tutorials/06_buildingAero/constant/pRef
FoamFile
{
    version     2.0;
    format     ascii;
    class     uniformDimensionedScalarField;
    object     pRef;
    location     constant;
}

dimensions [1 -1 -2 0 0 0 0];
value 100000;
