tutorials/06_buildingAero/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "inlet"
    {
        type            fixedValue;
        value           uniform (10 0 0);
    }

    "outlet"
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    "ground"
    {
        type            noSlip;
    }

    "ceiling"
    {
        type            noSlip;
    }

    "leftWall"
    {
        type            noSlip;
    }

    "rightWall"
    {
        type            noSlip;
    }

    "buildings"
    {
        type            noSlip;
    }

}

// ************************************************************************* //
