tutorials/06_buildingAero/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "inlet"
    {
        type            zeroGradient;
    }

    "outlet"
    {
        type            fixedValue;
        value           uniform 0;
    }

    "ground"
    {
        type            zeroGradient;
    }

    "ceiling"
    {
        type            zeroGradient;
    }

    "leftWall"
    {
        type            zeroGradient;
    }

    "rightWall"
    {
        type            zeroGradient;
    }

    "buildings"
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
