tutorials/06_buildingAero/0/epsilon
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 0.125;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "inlet"
    {
        type            fixedValue;
        value           uniform 0.03;
    }

    "outlet"
    {
        type            inletOutlet;
        inletValue      uniform 0.03;
        value           uniform 0.03;
    }

    "ground"
    {
        type            epsilonWallFunction;
        value           uniform 0.03;
    }

    "ceiling"
    {
        type            epsilonWallFunction;
        value           uniform 0.03;
    }

    "leftWall"
    {
        type            epsilonWallFunction;
        value           uniform 0.03;
    }

    "rightWall"
    {
        type            epsilonWallFunction;
        value           uniform 0.03;
    }

    "buildings"
    {
        type            epsilonWallFunction;
        value           uniform 0.03;
    }

}

// ************************************************************************* //
