tutorials/06_buildingAero/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.375;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "inlet"
    {
        type            fixedValue;
        value           uniform 1.5;
    }

    "outlet"
    {
        type            inletOutlet;
        inletValue      uniform 1.5;
        value           uniform 1.5;
    }

    "ground"
    {
        type            kqRWallFunction;
        value           uniform 1.5;
    }

    "ceiling"
    {
        type            kqRWallFunction;
        value           uniform 1.5;
    }

    "leftWall"
    {
        type            kqRWallFunction;
        value           uniform 1.5;
    }

    "rightWall"
    {
        type            kqRWallFunction;
        value           uniform 1.5;
    }

    "buildings"
    {
        type            kqRWallFunction;
        value           uniform 1.5;
    }

}

// ************************************************************************* //
