tutorials/06_buildingAero/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "inlet"
    {
        type            calculated;
        value           uniform 0;
    }

    "outlet"
    {
        type            calculated;
        value           uniform 0;
    }

    "ground"
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    "ceiling"
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    "leftWall"
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    "rightWall"
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    "buildings"
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

}

// ************************************************************************* //
