tutorials/06_buildingAero/system/fvSchemes
FoamFile
{
    version     2.0;
    format     ascii;
    class     dictionary;
    object     fvSchemes;
}

ddtSchemes
{
    default steadyState;
}
gradSchemes
{
    default Gauss linear;
}
divSchemes
{
    default none;
    "div(phi,U)" bounded Gauss linearUpwind grad(U);
    "div(phi,k)" bounded Gauss upwind;
    "div(phi,epsilon)" bounded Gauss upwind;
    "div(phi,omega)" bounded Gauss upwind;
    "div((nuEff*dev2(T(grad(U)))))" Gauss linear;
}
laplacianSchemes
{
    default Gauss linear corrected;
    "laplacian(nuEff,k)" Gauss linear corrected;
    "laplacian(nuEff,epsilon)" Gauss linear corrected;
}
interpolationSchemes
{
    default linear;
}
snGradSchemes
{
    default corrected;
}
wallDist
{
    method meshWave;
}
