tutorials/06_buildingAero/system/fvSolution
FoamFile
{
    version     2.0;
    format     ascii;
    class     dictionary;
    object     fvSolution;
}

solvers
{
    p
    {
        solver GAMG;
        tolerance 1e-06;
        relTol 0.1;
        smoother GaussSeidel;
        nPreSweeps 0;
        nPostSweeps 2;
        cacheAgglomeration on;
        agglomerator faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels 1;
    }
    U
    {
        solver smoothSolver;
        tolerance 1e-05;
        relTol 0.1;
        smoother symGaussSeidel;
    }
    k
    {
        solver smoothSolver;
        tolerance 1e-05;
        relTol 0.1;
        smoother symGaussSeidel;
    }
    epsilon
    {
        solver smoothSolver;
        tolerance 1e-05;
        relTol 0.1;
        smoother symGaussSeidel;
    }
    nut
    {
        solver smoothSolver;
        tolerance 1e-05;
        relTol 0.1;
        smoother symGaussSeidel;
    }
}
SIMPLE
{
    nNonOrthogonalCorrectors 0;
    residualControl
    {
        p 1e-4;
        U 1e-4;
        "(k|epsilon)" 1e-4;
    }
    pRefCell 0;
    pRefValue 0;
}
relaxationFactors
{
    fields
    {
        p 0.3;
    }
    equations
    {
        U 0.7;
        "(k|epsilon).*" 0.7;
    }
}
