tutorials/06_buildingAero/system/surfaceFeaturesDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}

surfaces
(
    "buildings.eMesh"
);

includedAngle   60;
